Revit 2027 API
Element.GroupId Property
 The id of the group to which an element belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GroupId { get; }
Public ReadOnly Property GroupId As ElementId
	Get
public:
property ElementId^ GroupId {
	ElementId^ get ();
}
member GroupId : ElementId with get
Property Value
ElementId
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace